xargs.org
#+INCLUDE: ./main.setup
#+TITLE: xargs
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-28

* Overview
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG_EN:  Overview
  :LANG_ES:  Visión de conjunto
  :LANG_KO:  개요
  :LANG_ZH:  摘要
  :LANG_JA:  概要
  :END:      

#+BEGIN_LANG: en es ja
build and execute command lines from standard input
#+END_LANG
#+LANG_KO: 표준 입력에서 명령행 라인을 실행합니다.
#+LANG_ZH: 从标准输入构建并执行命令

** History
  :PROPERTIES: 
  :CUSTOM_ID: history
  :LANG_EN:  History
  :LANG_ES:  Historia
  :LANG_KO:  역사
  :LANG_ZH:  历史
  :LANG_JA:  歴史
  :END:    

** Releases
  :PROPERTIES: 
  :CUSTOM_ID: releases
  :LANG_EN:  Releases
  :LANG_ES:  Lanzamientos
  :LANG_KO:  릴리즈
  :LANG_ZH:  发布
  :LANG_JA:  リリース
  :END:    

** Introduction
  :PROPERTIES: 
  :CUSTOM_ID: introduction
  :LANG_EN:  Introduction
  :LANG_ES:  Introducción
  :LANG_KO:  소개
  :LANG_ZH:  介绍
  :LANG_JA:  はじめに
  :END:    

** Characteristic
  :PROPERTIES: 
  :CUSTOM_ID: characteristic
  :LANG_EN:  Characteristic
  :LANG_ES:  Característica
  :LANG_KO:  특징
  :LANG_ZH:  特点
  :LANG_JA:  特徴
  :END:    

* How to Install
  :PROPERTIES: 
  :CUSTOM_ID: how-to-install
  :LANG_EN:  How to Install
  :LANG_ES:  Cómo instalar
  :LANG_KO:  설치 방법
  :LANG_ZH:  如何安装
  :LANG_JA:  インストール方法
  :END:      

** Install
  :PROPERTIES: 
  :CUSTOM_ID: install
  :LANG_EN:  Install
  :LANG_ES:  Instalar
  :LANG_KO:  설치
  :LANG_ZH:  安装
  :LANG_JA:  インストール
  :END:      

{{{see(findutils#install)}}}

** Check
   :PROPERTIES: 
   :CUSTOM_ID: check
   :LANG_EN:  Check
   :LANG_ES:  Comprobar
   :LANG_KO:  확인
   :LANG_ZH:  检查
   :LANG_JA:  チェック
   :END:      

#+BEGIN_SRC sh
$ xargs --version
#+END_SRC

#+BEGIN_EXAMPLE
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.

Written by Eric B. Decker, James Youngman, and Kevin Dalley.
#+END_EXAMPLE

* Usage
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG_EN:  Usage
  :LANG_ES:  Uso
  :LANG_KO:  사용법
  :LANG_ZH:  如何使用
  :LANG_JA:  命令説明
  :END:      

** Syntax
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG_EN:  Syntax
   :LANG_ES:  Sintaxis
   :LANG_KO:  구조
   :LANG_ZH:  结构
   :LANG_JA:  構造
   :END:      

#+BEGIN_SRC sh
xargs  [-0prtx] [-E eof-str] [-e[eof-str]] [--eof[=eof-str]] [--null] [-d delimiter] [--delimiter delimiter] [-I replace-str] [-i[replace-str]] [--replace[=replace-str]]
       [-l[max-lines]] [-L max-lines] [--max-lines[=max-lines]] [-n max-args] [--max-args=max-args] [-s  max-chars]  [--max-chars=max-chars]  [-P  max-procs]  [--max-procs=max-
       procs]  [--process-slot-var=name]  [--interactive]  [--verbose]  [--exit]  [--no-run-if-empty]  [--arg-file=file] [--show-limits] [--version] [--help] [command [initial-
       arguments]]
#+END_SRC

# ** Description
#    :PROPERTIES: 
#    :CUSTOM_ID: description
#    :LANG_EN:  Description
#    :LANG_ES:  Descripción
#    :LANG_KO:  설명
#    :LANG_ZH:  详情
#    :LANG_JA:  说明
#    :END:      

** Options
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG_EN:  Options
   :LANG_ES:  Opciones
   :LANG_KO:  옵션
   :LANG_ZH:  选项
   :LANG_JA:  オプション
   :END:      

# ** Configuration
#    :PROPERTIES: 
#    :CUSTOM_ID: configuration
#    :LANG_EN:  Configuration
#    :LANG_ES:  Configuración
#    :LANG_KO:  설정
#    :LANG_ZH:  组态
#    :LANG_JA:  設定
#    :END:      

# ** Environment Variables
#    :PROPERTIES: 
#    :CUSTOM_ID: environment-variables
#    :LANG_EN:  Variables
#    :LANG_ES:  Variables de entorno
#    :LANG_KO:  환경 변수
#    :LANG_ZH:  环境变量
#    :LANG_JA:  環境変数
#    :END:      

# ** Commands
#    :PROPERTIES: 
#    :CUSTOM_ID: commands
#    :LANG_EN:  Commands
#    :LANG_ES:  Comandos
#    :LANG_KO:  명령어
#    :LANG_ZH:  命令
#    :LANG_JA:  コマンド
#    :END:      

# ** Examples
#    :PROPERTIES: 
#    :CUSTOM_ID: examples
#    :LANG_EN:  Examples
#    :LANG_ES:  Ejemplos
#    :LANG_KO:  사용 예
#    :LANG_ZH:  例子
#    :LANG_JA:  例
#    :END:      

* See also
  :PROPERTIES: 
  :CUSTOM_ID: seealso
  :LANG_EN:  See also
  :LANG_ES:  Ver también
  :LANG_KO:  관련 항목
  :LANG_ZH:  相关主题
  :LANG_JA:  関連項目
  :END:      

- {{{link(findutils)}}}
- {{{link(find)}}}
- {{{link(locate)}}}

* References
  :PROPERTIES: 
  :CUSTOM_ID: references
  :LANG_EN:  References
  :LANG_ES:  Referencias
  :LANG_KO:  참고자료
  :LANG_ZH:  参考
  :LANG_JA:  参考
  :END:      

- {{{see(findutils#references)}}}
