en/xargs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-02 Fri 11:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>xargs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="xargs - Linux Commands">
<meta name="description" content="build and execute command lines from standard input ">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="xargs - Linux Commands">
<meta property="og:description" content="build and execute command lines from standard input ">
<meta name="twitter:title" content="xargs - Linux Commands">
<meta name="twitter:description" content="build and execute command lines from standard input ">
<link rel="alternate" href="http://linux-command.org/en/xargs.html" hreflang="en" />
<link rel="alternate" href="http://linux-command.org/es/xargs.html" hreflang="es" />
<link rel="alternate" href="http://linux-command.org/ja/xargs.html" hreflang="ja" />
<link rel="alternate" href="http://linux-command.org/ko/xargs.html" hreflang="ko" />
<link rel="alternate" href="http://linux-command.org/zh/xargs.html" hreflang="zh" />
</head>
<body>
<div id="content">
<h1 class="title">xargs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">Overview</a>
<ul>
<li><a href="#history">History</a></li>
<li><a href="#releases">Releases</a></li>
<li><a href="#introduction">Introduction</a></li>
<li><a href="#characteristic">Characteristic</a></li>
</ul>
</li>
<li><a href="#how-to-install">How to Install</a>
<ul>
<li><a href="#install">Install</a></li>
<li><a href="#check">Check</a></li>
</ul>
</li>
<li><a href="#usage">Usage</a>
<ul>
<li><a href="#syntax">Syntax</a></li>
<li><a href="#options">Options</a></li>
</ul>
</li>
<li><a href="#seealso">See also</a></li>
<li><a href="#references">References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org58b0066" class="outline-2">
<h2 id="overview"><a id="org58b0066"></a>Overview</h2>
<div class="outline-text-2" id="text-overview">
<p>
build and execute command lines from standard input
</p>
</div>

<div id="outline-container-org2931cc6" class="outline-3">
<h3 id="history"><a id="org2931cc6"></a>History</h3>
<div class="outline-text-3" id="text-history">
</div>
</div>

<div id="outline-container-orgfbc8e5a" class="outline-3">
<h3 id="releases"><a id="orgfbc8e5a"></a>Releases</h3>
<div class="outline-text-3" id="text-releases">
</div>
</div>

<div id="outline-container-orgceefbc7" class="outline-3">
<h3 id="introduction"><a id="orgceefbc7"></a>Introduction</h3>
<div class="outline-text-3" id="text-introduction">
</div>
</div>

<div id="outline-container-orge3ee175" class="outline-3">
<h3 id="characteristic"><a id="orge3ee175"></a>Characteristic</h3>
<div class="outline-text-3" id="text-characteristic">
</div>
</div>
</div>

<div id="outline-container-orgf74bb2a" class="outline-2">
<h2 id="how-to-install"><a id="orgf74bb2a"></a>How to Install</h2>
<div class="outline-text-2" id="text-how-to-install">
</div>

<div id="outline-container-org083a920" class="outline-3">
<h3 id="install"><a id="org083a920"></a>Install</h3>
<div class="outline-text-3" id="text-install">
<p>
See <a href="./findutils.html#install">findutils</a>.
</p>
</div>
</div>

<div id="outline-container-org305d035" class="outline-3">
<h3 id="check"><a id="org305d035"></a>Check</h3>
<div class="outline-text-3" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ xargs --version
</pre>
</div>

<pre class="example">
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later &lt;http://gnu.org/licenses/gpl.html&gt;.
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.

Written by Eric B. Decker, James Youngman, and Kevin Dalley.
</pre>
</div>
</div>
</div>

<div id="outline-container-org699cdee" class="outline-2">
<h2 id="usage"><a id="org699cdee"></a>Usage</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-org9d7355e" class="outline-3">
<h3 id="syntax"><a id="org9d7355e"></a>Syntax</h3>
<div class="outline-text-3" id="text-syntax">
<div class="org-src-container">
<pre class="src src-sh">xargs  [-0prtx] [-E eof-str] [-e[eof-str]] [--eof[=eof-str]] [--null] [-d delimiter] [--delimiter delimiter] [-I replace-str] [-i[replace-str]] [--replace[=replace-str]]
       [-l[max-lines]] [-L max-lines] [--max-lines[=max-lines]] [-n max-args] [--max-args=max-args] [-s  max-chars]  [--max-chars=max-chars]  [-P  max-procs]  [--max-procs=max-
       procs]  [--process-slot-var=name]  [--interactive]  [--verbose]  [--exit]  [--no-run-if-empty]  [--arg-file=file] [--show-limits] [--version] [--help] [command [initial-
       arguments]]
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2e2cae" class="outline-3">
<h3 id="options"><a id="orge2e2cae"></a>Options</h3>
<div class="outline-text-3" id="text-options">
</div>
</div>
</div>

<div id="outline-container-org0e3bbdb" class="outline-2">
<h2 id="seealso"><a id="org0e3bbdb"></a>See also</h2>
<div class="outline-text-2" id="text-seealso">
<ul class="org-ul">
<li><a href="./findutils.html">findutils</a></li>
<li><a href="./find.html">find</a></li>
<li><a href="./locate.html">locate</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7259248" class="outline-2">
<h2 id="references"><a id="org7259248"></a>References</h2>
<div class="outline-text-2" id="text-references">
<ul class="org-ul">
<li>See <a href="./findutils.html#references">findutils</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-28</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-03-02 Fri 11:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
